<?php
/*  配列の要素を追加 */

$scores = [70, 90, 80];
$scores[] = 60; // 末尾に要素を追加

// 配列$moreScoresに$scoresの要素を続けて入れたい [10, 20, 30, 70, 90, 80 ]
$moreScores = [10, 20, 30, ...$scores]; // ... 配列の前にピリオドを3つつける
$moreScores = [10, 20, ...$scores , 30]; 

// echo count($moreScores) . PHP_EOL;
// echo array_sum($moreScores) . PHP_EOL;

print_r($moreScores);
/* 
Array
(
    [0] => 10
    [1] => 20
    [2] => 30
    [3] => 70
    [4] => 90
    [5] => 80
    [6] => 60
)

*/
// ＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝
// $scores = [70, 90, 80];
// $scores[] = 60; // 末尾に要素を追加

// // 配列$moreScoresに$scoresの要素を続けて入れたい [10, 20, 30, 70, 90, 80 ]
// $moreScores = [10, 20, 30, $scores];
// /* Array
// (
//     [0] => 10
//     [1] => 20
//     [2] => 30
//     [3] => Array
//         (
//             [0] => 70
//             [1] => 90
//             [2] => 80
//             [3] => 60 配列番号[3]の中身が配列になってしまう。
//         )

// ) */

// print_r($moreScores);

// ==================================
// $scores = [70, 90, 80];
// $scores[] = 60; // 末尾に要素を追加

// print_r($scores);

// /*                                                                               
// Array
// (
//     [0] => 70
//     [1] => 90
//     [2] => 80
//     [3] => 60
// )
// */